package com.apofig;

import static com.apofig.октавы.ВтораяОктава.*;
import static com.apofig.октавы.МалаяОктава.*;
import static com.apofig.октавы.ПерваяОктава.*;
import static com.apofig.октавы.ТретьяОктава.*;
import static com.apofig.октавы.ЧетвертаяОктава.*;

/**
 * User: sanja
 * Date: 16.07.13
 * Time: 21:24
 */
public class EphemeralFeeling_SadBeautifulPiano {

    public static void main(String[] args) {
        Синтезатор синтезатор = new Синтезатор(new RealMidiChannelFactory());

        Шаблон intro = getIntro();

        синтезатор.звучать(intro);
    }

    private static Шаблон getIntro() {
        Шаблон intro12 = getIntro12();
        Шаблон intro34 = getIntro34();
        Шаблон intro56 = getIntro56();
        Шаблон intro78 = getIntro78();
        return intro12.потом(intro34).потом(intro56).потом(intro78);
    }

    private static Шаблон getIntro12() {
        Звук l1 = Доля.четверть(H4);
        Звук l2 = Доля.четверть(Fis5);
        Звук l3 = Доля.четверть(H5);
        Звук l4 = Доля.четверть(Fis6);

        Шаблон sl1 = Шаблон.подряд(l1).потом(l2).потом(l3).потом(l4);

        Звук r1 = Доля.половина(D7);
        Звук r2 = Доля.четверть(Cis7);
        Звук r3 = Доля.половина(H6);
        Звук r4 = Доля.триЧетверти(D7);

        Шаблон sr1 = Шаблон.подряд(r1).потом(r2).потом(r3).потом(r4);

        return sl1.вместе(sr1);
    }


    public static Шаблон getIntro34() {
        Звук l1 = Доля.четверть(Fis4);
        Звук l2 = Доля.четверть(Cis5);
        Звук l3 = Доля.четверть(Fis5);
        Звук l4 = Доля.четверть(Cis6);

        Шаблон sl1 = Шаблон.подряд(l1).потом(l2).потом(l3).потом(l4);

        Звук r1 = Доля.половина(Cis7);
        Звук r2 = Доля.четверть(A6);
        Звук r3 = Доля.четверть(Fis6);

        Шаблон sr1 = Шаблон.подряд(r1).потом(r2).потом(r3);

        return sl1.вместе(sr1);
    }

    public static Шаблон getIntro56() {
        Звук l1 = Доля.четверть(H4);
        Звук l2 = Доля.четверть(Fis5);
        Звук l3 = Доля.четверть(H5);
        Звук l4 = Доля.четверть(D6);
        Звук l5 = Доля.четверть(Fis6);
        Звук l6 = Доля.четверть(D6);
        Звук l7 = Доля.четверть(H5);
        Звук l8 = Доля.четверть(Fis5);

        Шаблон sl1 = Шаблон.подряд(l1).потом(l2).потом(l3).потом(l4).потом(l5).потом(l6).потом(l7).потом(l8);

        Звук r1 = Доля.половина(D7, H6, Fis6);
        Звук r2 = Доля.четверть(Cis7);
        Звук r3 = Доля.половина(H6);
        Звук r4 = Доля.триЧетверти(D7);

        Шаблон sr1 = Шаблон.подряд(r1).потом(r2).потом(r3).потом(r4);

        return sl1.вместе(sr1);
    }

    public static Шаблон getIntro78() {
        Звук l1 = Доля.четверть(Fis4);
        Звук l2 = Доля.четверть(Cis5);
        Звук l3 = Доля.четверть(Fis5);
        Звук l4 = Доля.четверть(A5);
        Звук l5 = Доля.четверть(Cis6);
        Звук l6 = Доля.четверть(A5);
        Звук l7 = Доля.четверть(Fis5);
        Звук l8 = Доля.четверть(Cis5);

        Шаблон sl1 = Шаблон.подряд(l1).потом(l2).потом(l3).потом(l4).потом(l5).потом(l6).потом(l7).потом(l8);

        Звук r1 = Доля.триЧетверти(Cis7);
        Звук r2 = Доля.четверть(Fis6).увеличить(5);

        Шаблон sr1 = Шаблон.подряд(r1).потом(r2);

        return sl1.вместе(sr1);
    }
}
