package com.apofig;

import static com.apofig.октавы.ПерваяОктава.*;
import static com.apofig.октавы.ВтораяОктава.*;
import static com.apofig.октавы.МалаяОктава.*;

/**
 * User: sanja
 * Date: 16.07.13
 * Time: 21:24
 */
public class Main {

    public static void main(String[] args) {
        Синтезатор синтезатор = new Синтезатор(new RealMidiChannelFactory());

        Звук l1 = Доля.половина(G4, C5, E5);

        Звук r11 = Доля.четверть(C3);
        Звук r12 = Доля.половина(C3);
        Звук r13 = r11.изменить(9.0 / 12);
        Звук r14 = Доля.четверть(F3).изменить(3.0 / 12);

        Звук l2 = Доля.половина(G4, H4, D5);
        Звук r21 =  Доля.четверть(G3);
        Звук r22 = Доля.половина(G3);

        Звук l31 = Доля.половина(A4, C5, E5);
        Звук l32 = Доля.четверть(A4, C5, E5);
        Звук l33 = Доля.четверть(G4, C5, E5);
        Звук r31 = Доля.четверть(A3);
        Звук r32 = Доля.половина(A3);
        Звук r33 = Доля.четверть(G3);

        Звук l41 = Доля.половина(F4, A4, E5);
        Звук l42 = Доля.половина(F4, A4, D5);
        Звук r41 = Доля.четверть(F3);
        Звук r42 = Доля.половина(F3);
        Звук r43 = Доля.четверть(D3);

        Шаблон s1 = Шаблон.подряд(l1).потом(l1).вместе(Шаблон.подряд(r11).потом(r12).потом(r13).потом(r14));
        Шаблон s2 = Шаблон.подряд(l2).потом(l2).вместе(Шаблон.подряд(r21).потом(r22).потом(r21));
        Шаблон s3 = Шаблон.подряд(l31).потом(l32).потом(l33).вместе(Шаблон.подряд(r31).потом(r32).потом(r33));
        Шаблон s4 = Шаблон.подряд(l41).потом(l42).вместе(Шаблон.подряд(r41).потом(r42).потом(r43));

        Звук l51 = Доля.половина(C5, F5, A5);
        Звук l52 = Доля.четверть(C5, E5, G5);
        Звук l53 = Доля.четверть(C5, D5, F5);
        Звук r51 = Доля.четверть(C3);
        Звук r52 = Доля.половина(C3);

        Звук l61 = Доля.триЧетверти(C5, E5);
        Звук l62 = Доля.восьмая(G5);
        Звук r61 = Доля.четверть(C3);

        Шаблон s5 = Шаблон.подряд(l51).потом(l52).потом(l53).вместе(Шаблон.подряд(r51).потом(r52).потом(r51));
        Шаблон s6 = Шаблон.подряд(l61).потом(l62).потом(l62).вместе(Шаблон.подряд(r61).потом(r61).потом(r61).потом(r61));

        Шаблон ss1 = s1.потом(s2).потом(s3).потом(s4);
        Шаблон ss2 = ss1.частьДо(1.0 / 2).потом(s5).потом(s6);

        синтезатор.звучать(ss1.потом(ss2));
    }


}
