package com.apofig;

import static com.apofig.октавы.ПерваяОктава.*;
import static com.apofig.октавы.ВтораяОктава.*;
import static com.apofig.октавы.МалаяОктава.*;

/**
 * User: sanja
 * Date: 16.07.13
 * Time: 21:24
 */
public class Main {

    public static void main(String[] args) {
        Синтезатор синтезатор = new Синтезатор(new RealMidiChannelFactory());

        Звук l1 = Доля.половина(G4, C5, E5);
        Звук r11 = Доля.четверть(C3);
        Звук r12 = Доля.половина(C3);
        Звук r13 = r11.изменить(9.0 / 12);
        Звук r14 = Доля.четверть(F3).изменить(3.0 / 12);

        Звук l2 = Доля.половина(G4, H4, D5);
        Звук r21 = Доля.четверть(G3);
        Звук r22 = Доля.половина(G3);

        Звук l31 = Доля.половина(A4, C5, E5);
        Звук l32 = Доля.четверть(A4, C5, E5);
        Звук l33 = Доля.четверть(G4, C5, E5);
        Звук r31 = Доля.четверть(A3);
        Звук r32 = Доля.половина(A3);
        Звук r33 = Доля.четверть(G3);

        Звук l41 = Доля.половина(F4, A4, E5);
        Звук l42 = Доля.половина(F4, A4, D5);
        Звук r41 = Доля.четверть(F3);
        Звук r42 = Доля.половина(F3);
        Звук r43 = Доля.четверть(D3);

        Шаблон s1 = l1.потом(l1).вместе(r11.потом(r12).потом(r13).потом(r14));
        Шаблон s2 = l2.потом(l2).вместе(r21.потом(r22).потом(r21));
        Шаблон s3 = l31.потом(l32).потом(l33).вместе(r31.потом(r32).потом(r33));
        Шаблон s4 = l41.потом(l42).вместе(r41.потом(r42).потом(r43));

        Шаблон ss1 = s1.потом(s2).потом(s3).потом(s4);

        синтезатор.звучать(70, ss1.сначала());
    }
}
