package com.apofig;

import static com.apofig.октавы.ПерваяОктава.*;
import static com.apofig.октавы.ВтораяОктава.*;
import static com.apofig.октавы.ТретьяОктава.*;
import static com.apofig.октавы.МалаяОктава.*;

/**
 * User: sanja
 * Date: 16.07.13
 * Time: 21:24
 */
public class Main {

    public static void main(String[] args) {
        Синтезатор синтезатор = new Синтезатор(new RealMidiChannelFactory());

        Звук l1 = Доля.половина(G4, C5, E5);

        Звук r11 = Доля.четверть(C3);
        Звук r12 = Доля.половина(C3);
        Звук r13 = r11.изменить(9.0 / 12);
        Звук r14 = Доля.четверть(F3).изменить(3.0 / 12);

        Звук l2 = Доля.половина(G4, H4, D5);
        Звук r21 =  Доля.четверть(G3);
        Звук r22 = Доля.половина(G3);

        Звук l31 = Доля.половина(A4, C5, E5);
        Звук l32 = Доля.четверть(A4, C5, E5);
        Звук l33 = Доля.четверть(G4, C5, E5);
        Звук r31 = Доля.четверть(A3);
        Звук r32 = Доля.половина(A3);
        Звук r33 = Доля.четверть(G3);

        Звук l41 = Доля.половина(F4, A4, E5);
        Звук l42 = Доля.половина(F4, A4, D5);
        Звук r41 = Доля.четверть(F3);
        Звук r42 = Доля.половина(F3);
        Звук r43 = Доля.четверть(D3);

        Шаблон s1 = Шаблон.подряд(l1).потом(l1).вместе(Шаблон.подряд(r11).потом(r12).потом(r13).потом(r14));
        Шаблон s2 = Шаблон.подряд(l2).потом(l2).вместе(Шаблон.подряд(r21).потом(r22).потом(r21));
        Шаблон s3 = Шаблон.подряд(l31).потом(l32).потом(l33).вместе(Шаблон.подряд(r31).потом(r32).потом(r33));
        Шаблон s4 = Шаблон.подряд(l41).потом(l42).вместе(Шаблон.подряд(r41).потом(r42).потом(r43));

        Звук l51 = Доля.половина(C5, F5, A5);
        Звук l52 = Доля.четверть(C5, E5, G5);
        Звук l53 = Доля.четверть(C5, D5, F5);
        Звук r51 = Доля.четверть(C3);
        Звук r52 = Доля.половина(C3);

        Звук l61 = Доля.триЧетверти(C5, E5);
        Звук l62 = Доля.восьмая(G5);
        Звук r61 = Доля.четверть(C3);

        Шаблон s5 = Шаблон.подряд(l51).потом(l52).потом(l53).вместе(Шаблон.подряд(r51).потом(r52).потом(r51));
        Шаблон s6 = Шаблон.подряд(l61).потом(l62).потом(l62).вместе(Шаблон.подряд(r61).потом(r61).потом(r61).потом(r61));

        Шаблон ss1 = s1.потом(s2).потом(s3).потом(s4);
        Шаблон ss2 = ss1.частьДо(1.0 / 2).потом(s5).потом(s6);

        Звук r71 = Доля.половина(F4, A4, C5);
        Звук r72 = Доля.четверть(E4, G4, C5);
        Звук r73 = Доля.четверть(D4, F4, C5);
        Звук r74 = Доля.целая(C4, E4, C5);
        Шаблон s7p = Шаблон.подряд(l1).потом(l1).потом(l2).потом(l2);
        Шаблон s7r = s7p.потом(l31).потом(l31).потом(r71).потом(r71).потом(s7p).потом(r71).потом(r72).потом(r73).потом(r74);

        Звук g4 = Доля.четверть(G5);
        Звук g8 = Доля.восьмая(G5);
        Звук a4 = Доля.четверть(A5);
        Звук e4 = Доля.четверть(E5);
        Звук c8 = Доля.восьмая(C6);
        Звук d8 = Доля.восьмая(D6);
        Звук d4 = Доля.четверть(D6);
        Звук ee8 = Доля.восьмая(E6);
        Звук ee4 = Доля.четверть(E6);
        Звук ff4 = Доля.четверть(F6);

        Шаблон s71 = Шаблон.подряд(g4).потом(g8).потом(a4).потом(e4).потом(g4.изменить(1.5)).потом(g4).потом(c8).потом(d8.изменить(3));
        Шаблон s72 = Шаблон.подряд(ee8).потом(ee8).потом(ee8.изменить(3)).потом(d4).потом(d8.изменить(3)).потом(c8).потом(c8.изменить(5));
        Шаблон s73 = Шаблон.подряд(ee8).потом(ee4).потом(ff4.изменить(1.5)).потом(ee8).потом(ee4).потом(d4.изменить(2)).потом(ee8).потом(d4).потом(c8.изменить(4));
        Шаблон s7 = s7r.вместе(s71.потом(s72).потом(s73));

        синтезатор.звучать(ss1.потом(ss2).потом(s7r.вместе(s7)));
    }


}
