package com.apofig;

/**
 * User: sanja
 * Date: 20.01.14
 * Time: 0:15
 */
public class Арпеджио {
    public static Шаблон get(Нота нота1, Нота нота2, Нота нота3) {
        Звук звук1 = Доля.четверть(нота1, нота2);
        Шаблон l1 = Шаблон.подряд(звук1).потом(звук1).потом(звук1).потом(звук1);

        Звук звук2 = Доля.четверть(нота3);
        Шаблон l2 = Шаблон.подряд(Пауза.восьмая()).потом(звук2).потом(звук2).потом(звук2).потом(звук2);

        Шаблон l3 = l1.вместе(l2);
        return l3.частьДо(1/l3.длинна());
    }
}
