package com.apofig;

import java.util.List;

/**
 * User: sanja
 * Date: 20.01.14
 * Time: 0:15
 */
public class Арпеджио {
    public static Шаблон get(List<Нота> ноты) {
        Нота нота1 = ноты.get(0);
        Нота нота2 = ноты.get(1);
        Нота нота3 = ноты.get(2);

        Звук звук1 = Доля.четверть(нота2, нота3);
        Шаблон l1 = Шаблон.подряд(звук1).потом(звук1).потом(звук1).потом(звук1);

        Звук звук2 = Доля.четверть(нота1);
        Шаблон l2 = Шаблон.подряд(Пауза.восьмая()).потом(звук2).потом(звук2).потом(звук2).потом(звук2);

        Шаблон l3 = l1.вместе(l2);
        return l3.частьДо(1/l3.длинна());
    }

    public static Шаблон get2(Нота нота) {
        Нота нота2 = нота.ниже(Интервал.ЧистаяОктава);

        Звук звук1 = Доля.половина(нота, нота2);

        return Шаблон.подряд(звук1).потом(Пауза.четверть()).потом(звук1.увеличить(0.5));
    }
}
