package com.apofig;

/**
 * User: sanja
 * Date: 16.07.13
 * Time: 21:36
 */
public enum Интервал {

    ЧистаяПрима(0),
    МалаяСекунда(1), Полутон(1),
    БольшаяСекунда(2), Тон(2),
    МалаяТерция(3),
    БольшаяТерция(4),
    ЧистаяКварта(5),
    УвеличеннаяКварта(6), УменьшеннаяКвинта(6),
    ЧистаяКвинта(7),
    МалаяСекста(8),
    БольшаяСекста(9),
    МалаяСептима(10),
    БольшаяСептима(11),
    ЧистаяОктава(12);

    private int интервал;

    private Интервал(int интервал) {
        this.интервал = интервал;
    }

    public int интервал() {
        return интервал;
    }
}
