package com.apofig;

import com.apofig.октавы.ПерваяОктава;
import org.junit.Test;

import static junit.framework.Assert.assertEquals;

/**
 * User: sanja
 * Date: 26.07.13
 * Time: 22:34
 */
public class ШаблонTest {

    @Test
    public void test() {
        Звук c = Доля.половина(ПерваяОктава.C4);
        Звук d = Доля.половина(ПерваяОктава.D4);

        Шаблон шаблон = Шаблон.подряд(c).потом(d);

        assertШаблон(шаблон, 0.5, 2, 
                "{0.0=[[C4(48)!100]], " +
                "0.5=[[C4(48)!0], [D4(50)!100]], " +
                "1.0=[[D4(50)!0]]}");
    }

    private void assertШаблон(Шаблон шаблон, double размерТика, int количество, String expected) {
        assertEquals(expected, шаблон.toString());
        assertEquals(размерТика, шаблон.размерТика());
        assertEquals(количество, шаблон.тиков());
    }

    @Test
    public void test2() {
        Звук c = Доля.половина(ПерваяОктава.C4);
        Звук d = Доля.половина(ПерваяОктава.D4);
        Звук a = Доля.четверть(ПерваяОктава.A4);

        Шаблон шаблон = Шаблон.подряд(c).потом(d).потом(a);

        assertШаблон(шаблон, 0.25, 5,
                "{0.0=[[C4(48)!100]], " +
                "0.5=[[C4(48)!0], [D4(50)!100]], " +
                "1.0=[[D4(50)!0], [A4(57)!100]], " +
                "1.25=[[A4(57)!0]]}");
    }


    @Test
    public void test3() {
        Звук c = Доля.половина(ПерваяОктава.C4);
        Звук d = Доля.половина(ПерваяОктава.D4);

        Шаблон шаблон = Шаблон.подряд(c).вместе(Шаблон.подряд(d));

        assertШаблон(шаблон, 0.5, 1,
                "{0.0=[[C4(48)!100], [D4(50)!100]], " +
                "0.5=[[C4(48)!0], [D4(50)!0]]}");
    }

    @Test
    public void test4() {
        Звук c = Доля.половина(ПерваяОктава.C4);
        Звук d = Доля.половина(ПерваяОктава.D4);
        Звук a = Доля.четверть(ПерваяОктава.A4);

        Шаблон шаблон = Шаблон.подряд(c).вместе(Шаблон.подряд(d).потом(a));

        assertШаблон(шаблон, 0.25, 3,
                "{0.0=[[C4(48)!100], [D4(50)!100]], " +
                "0.5=[[C4(48)!0], [D4(50)!0], [A4(57)!100]], " +
                "0.75=[[A4(57)!0]]}");
    }

    @Test
    public void test5() {
        Звук c = Доля.половина(ПерваяОктава.C4);
        Звук d = Доля.половина(ПерваяОктава.D4);
        Звук a = Доля.четверть(ПерваяОктава.A4);

        Шаблон шаблон = Шаблон.подряд(c).потом(a).вместе(Шаблон.подряд(d).потом(a)).потом(c);

        assertШаблон(шаблон, 0.25, 5,
                "{0.0=[[C4(48)!100], [D4(50)!100]], " +
                "0.5=[[C4(48)!0], [A4(57)!100], [D4(50)!0], [A4(57)!100]], " +
                "0.75=[[A4(57)!0], [A4(57)!0], [C4(48)!100]], " +
                "1.25=[[C4(48)!0]]}");
    }
}
