package com.apofig.music;

import com.apofig.*;

import static com.apofig.октавы.ВтораяОктава.Cis5;
import static com.apofig.октавы.ВтораяОктава.E5;
import static com.apofig.октавы.ПерваяОктава.A4;
import static com.apofig.октавы.ПерваяОктава.H4;

/**
 * User: sanja
 * Date: 16.07.13
 * Time: 21:24
 */
public class FourChords {

    public static void main(String[] args) {
        Синтезатор синтезатор = new Синтезатор(new RealMidiChannelFactory());

        Нота n1 = E5;
        Нота n2 = H4;
        Нота n3 = Cis5;
        Нота n4 = A4;

        Шаблон l1 = Арпеджио.get(Трезвучие.Мажорное.get(n1));
        Шаблон l2 = Арпеджио.get(Трезвучие.Мажорное.get(n2));
        Шаблон l3 = Арпеджио.get(Трезвучие.Минорное.get(n3));
        Шаблон l4 = Арпеджио.get(Трезвучие.Мажорное.get(n4));

        Шаблон s1 = l1.потом(l2).потом(l3).потом(l4);

        Шаблон r1 = Арпеджио.get2(n1.ниже(Интервал.ЧистаяОктава));
        Шаблон r2 = Арпеджио.get2(n2.ниже(Интервал.ЧистаяОктава));
        Шаблон r3 = Арпеджио.get2(n3.ниже(Интервал.ЧистаяОктава));
        Шаблон r4 = Арпеджио.get2(n4.ниже(Интервал.ЧистаяОктава));

        Шаблон s2 = r1.потом(r2).потом(r3).потом(r4);

        Шаблон r = s1.вместе(s2);

        синтезатор.звучать(r.потом(r).потом(r).потом(r).потом(r));
    }


}
