package com.apofig.music;

import com.apofig.*;
import com.apofig.parser.Parser;

/**
 * User: sanja
 * Date: 16.07.13
 * Time: 21:24
 */
public class SuperMario {

    public static void main(String[] args) {
        Синтезатор синтезатор = new Синтезатор(new RealMidiChannelFactory());

        синтезатор.звучать(get1().потом(get2()));
    }

    public static Шаблон get1() {
        String source =
                "G3  ║        :     +  ║\n" +
                "D4  ║++ + ++ :        ║\n" +
                "G4  ║        :+       ║\n" +
                "Fis5║++ + ++ :        ║\n" +
                "G5  ║        :+       ║\n" +
                "C6  ║     +  :        ║\n" +
                "E6  ║++ +  + :        ║\n" +
                "G6  ║        :+       ║\n" +
                "";

        return Parser.parse(source);
    }

    public static Шаблон get2() {
        String source =
                // -----------------------------------------------
                "C4  ║       +        ║         +      ║\n" +
                "Cis4║                ║                ║\n" +
                "D4  ║                ║                ║\n" +
                "Dis4║                ║                ║\n" +
                "E4  ║    +           ║                ║\n" +
                // -----------------------------------------------
                "F4  ║          +    +║     +       +  ║\n" +
                "Fis4║              + ║                ║\n" +
                "G4  ║ +     +    +   ║ +         +    ║\n" +
                "Gis4║                ║                ║\n" +
                "A4  ║                ║                ║\n" +
                "Ais4║                ║                ║\n" +
                "H4  ║                ║               +║\n" +
                // -----------------------------------------------
                "C5  ║    +     +    +║   +   +   +    ║\n" +
                "Cis5║              + ║                ║\n" +
                "D5  ║            +   ║               +║\n" +
                "Dis5║                ║                ║\n" +
                "E5  ║ +     +        ║   +            ║\n" +
                // -----------------------------------------------
                "F5  ║                ║                ║\n" +
                "Fis5║                ║                ║\n" +
                "G5  ║    +           ║ +     +        ║\n" +
                "Gis5║                ║                ║\n" +
                "A5  ║          +    +║                ║\n" +
                "Ais5║              + ║                ║\n" +
                "H5  ║            +   ║              + ║\n" +
                // -----------------------------------------------
                "C6  ║ +              ║            +   ║\n" +
                "Cis6║                ║                ║\n" +
                "D6  ║                ║             +  ║\n" +
                "Dis6║                ║                ║\n" +
                "E6  ║                ║   +      +     ║\n" +
                // -----------------------------------------------
                "F6  ║                ║       +        ║\n" +
                "Fis6║                ║                ║\n" +
                "G6  ║                ║    +   +       ║\n" +
                "Gis6║                ║                ║\n" +
                "A6  ║                ║     +-         ║\n" +
                "Ais6║                ║                ║\n" +
                "H4  ║                ║                ║\n" +
                // -----------------------------------------------
                "" ;
        return Parser.parse(source);
    }
}
